/****************************************************************************************
  * @file    Config.h
  * @author  尖叫的变压器
  * @version V1.0.0
  * @date    12-Jan-2023
	* @数字电源交流群  599937745
  * @淘宝店铺链接：https://shop239216898.taobao.com/?spm=2013.1.1000126.d21.5e571852VY9erz
  * @LegalDeclaration ：本文档内容难免存在Bug，仅限于交流学习，禁止用于任何的商业用途
	* @Copyright   著作权归数字电源开源社区所有
*****************************************************************************************/

#ifndef __CONFIG_H__ 
#define __CONFIG_H__

/******************************IO口配置***************************************

串口通信IO配置

 PB6   USART1_TX  		串口接发送           
 PB7   USART1_RX  		串口发接收 			 		 
********************************************
串口通信IO配置

 PB10   USART3_TX    串口接发送           
 PB11   USART3_RX  	串口发接收 			 		 
********************************************
CAN通信IO配置

 PB9   CAN_TX  		  CAN发送           
 PB8   CAN_RX  		  CAN接收 			 		 
********************************************
 LED控制IO
 
 PA15     RED         高电平有效   
 PB15     GREEN       高电平有效     
********************************************
 PA11     使能Driver
********************************************
PWM输出IO配置
 
 PA8     HRTIM_CHA1  推挽输出             设置AF_13
 PA9     HRTIM_CHA2  推挽输出             设置AF_13

ADC检测IO配置
              
 PA0   ADC1_IN1      模拟    Iin_detc
 PA1   ADC1_IN2      模拟    Vin_detc
 PA2   ADC1_IN3      模拟    IL_detc
 PA5   ADC2_IN2      模拟    Iout_detc
 PA6   ADC2_IN3      模拟    Vb_detc

DAC 配置
  
 PA4          DAC1_CH1
 DAC1_OUT1    接入COMP2_INM 

比较器接口
 PA7          COMP2_INP  检测电感电流

调试接口

 PA13   SWDIO
 PA14   SWCLK

其它未用到的IO：配置为推挽输出低电平

**********************************************/

#endif
